Model: "sequential_48"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_131 (Conv1D)          (None, 12, 128)           384       
_________________________________________________________________
max_pooling1d_83 (MaxPooling (None, 6, 128)            0         
_________________________________________________________________
dropout_116 (Dropout)        (None, 6, 128)            0         
_________________________________________________________________
conv1d_132 (Conv1D)          (None, 5, 256)            65792     
_________________________________________________________________
max_pooling1d_84 (MaxPooling (None, 2, 256)            0         
_________________________________________________________________
dropout_117 (Dropout)        (None, 2, 256)            0         
_________________________________________________________________
flatten_37 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_102 (Dense)            (None, 64)                32832     
_________________________________________________________________
dense_103 (Dense)            (None, 16)                1040      
_________________________________________________________________
dense_104 (Dense)            (None, 2)                 34        
=================================================================
Total params: 100,082
Trainable params: 100,082
Non-trainable params: 0
_________________________________________________________________
