Model: "sequential_71"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_179 (Conv1D)          (None, 12, 128)           384       
_________________________________________________________________
max_pooling1d_126 (MaxPoolin (None, 6, 128)            0         
_________________________________________________________________
dropout_162 (Dropout)        (None, 6, 128)            0         
_________________________________________________________________
conv1d_180 (Conv1D)          (None, 5, 256)            65792     
_________________________________________________________________
max_pooling1d_127 (MaxPoolin (None, 2, 256)            0         
_________________________________________________________________
dropout_163 (Dropout)        (None, 2, 256)            0         
_________________________________________________________________
flatten_58 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_165 (Dense)            (None, 64)                32832     
_________________________________________________________________
dense_166 (Dense)            (None, 16)                1040      
_________________________________________________________________
dense_167 (Dense)            (None, 2)                 34        
=================================================================
Total params: 100,082
Trainable params: 100,082
Non-trainable params: 0
_________________________________________________________________
