Model: "sequential_49"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_133 (Conv1D)          (None, 12, 128)           384       
_________________________________________________________________
max_pooling1d_85 (MaxPooling (None, 6, 128)            0         
_________________________________________________________________
dropout_118 (Dropout)        (None, 6, 128)            0         
_________________________________________________________________
conv1d_134 (Conv1D)          (None, 5, 256)            65792     
_________________________________________________________________
max_pooling1d_86 (MaxPooling (None, 2, 256)            0         
_________________________________________________________________
dropout_119 (Dropout)        (None, 2, 256)            0         
_________________________________________________________________
flatten_38 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_105 (Dense)            (None, 64)                32832     
_________________________________________________________________
dense_106 (Dense)            (None, 16)                1040      
_________________________________________________________________
dense_107 (Dense)            (None, 2)                 34        
=================================================================
Total params: 100,082
Trainable params: 100,082
Non-trainable params: 0
_________________________________________________________________
