Model: "sequential_53"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_141 (Conv1D)          (None, 12, 128)           384       
_________________________________________________________________
max_pooling1d_93 (MaxPooling (None, 6, 128)            0         
_________________________________________________________________
dropout_126 (Dropout)        (None, 6, 128)            0         
_________________________________________________________________
conv1d_142 (Conv1D)          (None, 5, 256)            65792     
_________________________________________________________________
max_pooling1d_94 (MaxPooling (None, 2, 256)            0         
_________________________________________________________________
dropout_127 (Dropout)        (None, 2, 256)            0         
_________________________________________________________________
flatten_42 (Flatten)         (None, 512)               0         
_________________________________________________________________
dense_117 (Dense)            (None, 64)                32832     
_________________________________________________________________
dense_118 (Dense)            (None, 16)                1040      
_________________________________________________________________
dense_119 (Dense)            (None, 2)                 34        
=================================================================
Total params: 100,082
Trainable params: 100,082
Non-trainable params: 0
_________________________________________________________________
